IDEA StatiCa Open Model
ConnectionSetup.RigidBP Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 True if rigid base plate is considered
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool RigidBP { get; set; }
Public Property RigidBP As Boolean
	Get
	Set
public:
property bool RigidBP {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
ConnectionSetup Class
IdeaRS.OpenModel Namespace